// SPDX-License-Identifier: MIT
// SPDX 用于声明开源协议
// MIT 是最常见的 Solidity 开源许可证

pragma solidity ^0.8.20;
// 指定 Solidity 编译器版本
// ^0.8.20 表示：
// >=0.8.20 且 <0.9.0 都可以编译

contract MyContract {
    // contract = 智能合约
    // 类似 Java 里的 class
    // 部署后会生成一个链上地址

    // =========================================================
    // 1. State Variable（状态变量）
    // =========================================================

    uint public count;
    // uint = 无符号整数
    // public = 自动生成 getter 读取函数
    // count 会永久存储在区块链 storage 中

    // =========================================================
    // 2. Event（事件）
    // =========================================================

    event Increment(address user, uint value);
    // event = 链上日志系统
    // 用于记录重要行为
    // 前端 / 区块浏览器可以监听

    // 参数：
    // user  = 谁触发了 increment
    // value = increment 后的新值

    // =========================================================
    // 3. Modifier（修饰器）
    // =========================================================

    modifier onlyOwner() {
        // modifier = 函数执行前的统一规则

        // "_" 表示：
        // 真正函数逻辑插入这里

        _;
    }

    // =========================================================
    // 4. Constructor（构造函数）
    // =========================================================

    constructor() {
        // constructor 会在部署时执行一次

        // 常用于：
        // 1. 初始化 owner
        // 2. 初始化状态
        // 3. 初始化配置
    }

    // =========================================================
    // 5. Function（函数）
    // =========================================================

    function increment() public {
        // public = 任何地址都能调用

        count++;
        // 等价于：
        // count = count + 1

        // 修改 storage
        // 会消耗 Gas

        emit Increment(msg.sender, count);
        // emit = 触发 event

        // msg.sender =
        // 当前调用这个函数的钱包地址
    }

    // =========================================================
    // 6. Struct（结构体）
    // =========================================================

    struct User {
        // struct = 自定义数据结构

        uint age;
    }

    // 类似 Java：

    /*
    class User {
        int age;
    }
    */

    // =========================================================
    // 7. Enum（枚举）
    // =========================================================

    enum State {
        Open,
        Closed
    }

    // enum = 有限状态集合

    // Open   = 0
    // Closed = 1

    // 常用于：
    // 订单状态
    // NFT销售状态
    // DAO投票状态

    // =========================================================
    // 8. Custom Error（自定义错误）
    // =========================================================

    error NotEnoughBalance(uint current, uint required);

    // error 比 require("string")
    // 更省 Gas

    // current  = 当前余额
    // required = 需要余额
}